Repository: axodox/GreenScan
Catalog: GreenScan/GreenScan/Properties/Resources.*.resx
Languages: hu_hu

# AboutCopyright
source: All rights reserved.
hu_hu: Minden jog fenntartva.

# AboutCreatedBy
source: created by Péter Major
hu_hu: készítette Major Péter

# AboutTitle
source: About
hu_hu: Névjegy

# CommonBrowse
source: Browse
hu_hu: Tallózás

# CommonFinish
source: Finish
hu_hu: Befejezés

# CommonInformation
source: Information
hu_hu: Információ

# CommonNext
source: Next
hu_hu: Következő

# CommonPrevious
source: Previous
hu_hu: Előző

# CommonProgress
source: Progress
hu_hu: Állapot

# CommonResults
source: Results
hu_hu: Eredmények

# CommonStart
source: Start
hu_hu: Kezdés

# EnumGraphicsCanvasShadingModes
source: Zebra|Rainbow|Shaded rainbow|Scale|Shaded scale|Blinn|Textured
hu_hu: Zebra|Szivárványszín|Árnyalt szivárványszín|Skála|Árnyalt skála|Blinn|Textúrázott

# EnumKinectManagerModes
source: Depth|Color|Depth with color|Infrared
hu_hu: Mélység|Színes|Mélység + színes|Infravörös

# EnumRotatingScannerModes
source: One-axis|Two-axis|Volumetric
hu_hu: Egytengelyű|Kéttengelyű|Volumetrikus

# EnumRotatingScannerViews
source: Overlay|Depth - left leg|Depth - right leg|Texture - left leg|Texture - right leg|Model
hu_hu: Ellenőrző|Mélység - bal láb|Mélység - jobb láb|Textúra - bal láb|Textúra - jobb láb|Modell

# EnumRotatingScannerVolumetricViews
source: Overlay|Projection|Slice|Model
hu_hu: Ellenőrző|Vetítési|Metszet|Modell

# ImportFileFilter
source: Float4 files (*.fl4)|*.fl4|Vector4 files (*.vector4)|*.vector4
hu_hu: Float4 fájlok (*.fl4)|*.fl4|Vector4 fájlok (*.vector4)|*.vector4

# ImportFileTitle
source: Import model
hu_hu: Modell importálása

# KinectCalibrationClear
source: Clear
hu_hu: Törlés

# KinectCalibrationColor
source: Color
hu_hu: Színes

# KinectCalibrationControls
source: Controls
hu_hu: Vezérlés

# KinectCalibrationDepth
source: Depth
hu_hu: Mélységi

# KinectCalibrationInfrared
source: Infrared
hu_hu: Infravörös

# KinectCalibrationPath
source: Path
hu_hu: Mentés helye

# KinectCalibrationSelectDirectory
source: Select calibration directory
hu_hu: Válassza ki a kalibráció célkönyvtárát!

# KinectCalibrationStatus
source: {0} positions captured.
hu_hu: {0} helyzet rögzítve.

# KinectCalibrationTitle
source: Kinect Calibration
hu_hu: A Kinect kalibrációja

# MenuAbout
source: About
hu_hu: Névjegy

# MenuDevice
source: Device
hu_hu: Eszköz

# MenuDeviceCalibrate
source: Calibrate...
hu_hu: Kalibráció...

# MenuDeviceDevice
source: Device
hu_hu: Eszköz

# MenuDeviceMode
source: Mode
hu_hu: Működési mód

# MenuDeviceStart
source: Start
hu_hu: Indítás

# MenuDeviceStop
source: Stop
hu_hu: Leállítás

# MenuExportAs
source: Export as
hu_hu: Exportálás mint

# MenuExportAsFl4
source: Vector4 FL4
hu_hu: Vektor4 FL4

# MenuExportAsPng
source: Image PNG
hu_hu: Kép PNG

# MenuExportAsPngAsOriginal
source: As original
hu_hu: Mint az eredeti

# MenuExportAsPngAsScreenshot
source: As screenshot
hu_hu: Mint képernyőkép

# MenuExportAsStl
source: Binary STL
hu_hu: Bináris STL

# MenuFile
source: File
hu_hu: Fájl

# MenuFileBrowseSaveDirectory
source: Browse save directory
hu_hu: Mentési könyvtár megnyitása...

# MenuFileCloseFile
source: Close file
hu_hu: Fájl bezárása

# MenuFileExit
source: Exit
hu_hu: Kilépés

# MenuFileImport
source: Import...
hu_hu: Importálás...

# MenuOpenModel
source: Open model...
hu_hu: Modell megnyitása...

# MenuSaveModel
source: Save model
hu_hu: Modell mentése

# MenuTurntable
source: Turntable
hu_hu: Forgópad

# MenuTurntableCalibrate
source: Calibrate...
hu_hu: Kalibráció...

# MenuTurntableCountSteps
source: Count steps...
hu_hu: Lépés számlálás...

# MenuTurntableReturnToOrigin
source: Return to origin
hu_hu: Visszatérés alaphelyzetbe

# MenuTurntableScan
source: Scan
hu_hu: Szkennelés

# MenuTurntableStop
source: Stop
hu_hu: Leállítás

# MessageKinectDisconnected
source: The Kinect has been disconnected.
hu_hu: A Kinectet leválasztották.

# MessageTurntableNotCalibrated
source: The turntable is not calibrated would you like to calibrate it?
hu_hu: A forgópad nincs kalibrálva, szeretné most kalibrálni?

# OpenFileTitle
source: Open file
hu_hu: Fájl megnyitása

# OpenRawFileFilter
source: GreenScan raw files
hu_hu: GreenScan nyers fájlok

# OpenTurntableRawFileFilter
source: GreenScan Turntable raw files
hu_hu: GreenScan forgópad nyers fájlok

# OpenUnsuccesful
source: Opening was unsuccessful.
hu_hu: Fájl megnyitása sikertelen.

# RemotingRemotedFrom
source: Romoted from {0}.
hu_hu: Távirányítva innen: {0}.

# RemotingRemotesConnected
source: {0} remote(s) connected.
hu_hu: {0} távirányító kapcsolódik.

# SaveUnsuccesful
source: Saving was unsuccessful!
hu_hu: Mentés sikertelen!

# SettingColorDispositionX
source: Color X disposition (pixels)
hu_hu: Színes kép eltolása X irányban (pixelben)

# SettingColorDispositionY
source: Color Y disposition (pixels)
hu_hu: Színes kép eltolása Y irányban (pixelben)

# SettingColorExtrinsics
source: Color extrinsics
hu_hu: Színes extrinzik mátrix

# SettingColorIntrinsics
source: Color intrinsic matrix
hu_hu: Színes intrinzik mátrix

# SettingColorRemapping
source: Color remapping
hu_hu: Színes leképezés

# SettingColorScaleX
source: Color X scale (units)
hu_hu: Színes kép nagyítása X irányban (egységben)

# SettingColorScaleY
source: Color Y scale (units)
hu_hu: Színes kép nagyítása Y irányban (egységben)

# SettingDepthAveraging
source: Depth averaging buffer size (slots)
hu_hu: Mélység átlagolási puffer mérete (rekeszek)

# SettingDepthCoeffs
source: Depth coefficients (units)
hu_hu: Mélység együtthatók (egységben)

# SettingDepthGaussIterations
source: Depth Gauss filtering (iterations)
hu_hu: Mélységkép Gauss szűrése (iterációk)

# SettingDepthGaussSigma
source: Depth Gauss filtering sigma (units)
hu_hu: Mélységkép Gauss szűrése - szigma (egységben)

# SettingDepthMaximum
source: Depth maximum (meters)
hu_hu: Maximális mélység (méterben)

# SettingDepthMinimum
source: Depth minimum (meters)
hu_hu: Minimális mélység (méterben)

# SettingDepthToIRMapping
source: Depth to IR mapping
hu_hu: Mélységből -> Infravörös leképezés

# SettingGroupCamera
source: Camera
hu_hu: Kamerák

# SettingGroupKinectFooter
source: *Applies to Kinect for Windows only
hu_hu: *Csak a Kinect for Windows eszközökre vonatkozik

# SettingGroupPerformance
source: Performance
hu_hu: Teljesítmény

# SettingGroupPreprocessing
source: Preprocessing
hu_hu: Előfeldolgozás

# SettingGroupSave
source: Saving
hu_hu: Mentés

# SettingGroupShading
source: Shading
hu_hu: Árnyalás

# SettingGroupTurntable
source: Turntable
hu_hu: Forgópad

# SettingGroupTurntableAxial
source: Axial scanning
hu_hu: Axiális szkennelés

# SettingGroupTurntableVolumetric
source: Volumetric scanning
hu_hu: Volumetrikus szkennelés

# SettingGroupView
source: View
hu_hu: Nézet

# SettingInfraredDistortion
source: Infrared distortion coefficients {K1, K2; P1, P2}
hu_hu: Infravörös torzítási együtthatók {K1, K2; P1, P2}

# SettingInfraredDistortionCorrectionEnabled
source: Infrared distortion correction enabled
hu_hu: Infravörös torzítás korrekció bekapcsolva

# SettingInfraredIntrinsics
source: Infrared intrinsic matrix
hu_hu: Infravörös intrinzik mátrix

# SettingKinectEmitterEnabled
source: Emitter enabled*
hu_hu: Infravörös projektor engedélyezve*

# SettingKinectMode
source: Mode
hu_hu: Működési mód

# SettingKinectNearMode
source: Near mode*
hu_hu: Közel mód engedélyezve*

# SettingMoveX
source: Move X (units)
hu_hu: Eltolás X irányban (egységben)

# SettingMoveY
source: Move Y (units)
hu_hu: Eltolás Y irányban (egységben)

# SettingRotation
source: Rotation (units)
hu_hu: Forgatás (egységben)

# SettingRotationX
source: Rotation X (degrees)
hu_hu: Forgatás X tengely körül (fokban)

# SettingRotationY
source: Rotation Y (degrees)
hu_hu: Forgatás Y tengely körül (fokban)

# SettingRotationZ
source: Rotation Z (degrees)
hu_hu: Forgatás Z tengely körül (fokban)

# SettingSaveCalibrationDirectory
source: Calibration directory
hu_hu: Kalibráció könyvtára

# SettingSaveDirectory
source: Directory
hu_hu: Célkönyvtár

# SettingSaveLabel
source: Label
hu_hu: Címke

# SettingSaveModelResolution
source: Model resolution (vertices)
hu_hu: Modell felbontása (vertexekben)

# SettingSaveNoTimestamp
source: No timestamp if label specified
hu_hu: Nincs időbélyeg, ha a címkét megadták

# SettingSaveScalingPower
source: Scaling power (10^x)
hu_hu: Skálázás (10^x)

# SettingSaveTextureResolution
source: Texture resolution (pixels)
hu_hu: Textúra felbontása (pixelekben)

# SettingScale
source: Scale (units)
hu_hu: Nagyítás (egységben)

# SettingShadingMode
source: Mode
hu_hu: Árnyalási mód

# SettingShadingPeriode
source: Shading periode (meters)
hu_hu: Árnyalási periódus (egységben)

# SettingShadingPhase
source: Shading phase (units)
hu_hu: Árnyalási fázis (egységben)

# SettingTranslationX
source: Translation X (meters)
hu_hu: Eltolás X irányban (méterben)

# SettingTranslationY
source: Translation Y (meters)
hu_hu: Eltolás Y irányban (méterben)

# SettingTranslationZ
source: Translation Z (meters)
hu_hu: Eltolás Z irányban (méterben)

# SettingTriangleGridResolution
source: Triangle grid resolution
hu_hu: Háromszögháló felbontása

# SettingTriangleRemoveLimit
source: Triangle remove limit (units)
hu_hu: Háromszög eldobási határ (egységben)

# SettingTurntableAxialClippingHeight
source: Clipping height (meters)
hu_hu: Vágási magasság (méterben)

# SettingTurntableAxialClippingRadius
source: Clipping radius (meters)
hu_hu: Vágási sugár (méterben)

# SettingTurntableAxialCoreX
source: Leg distance (meters)
hu_hu: Lábak távolsága (méterben)

# SettingTurntableAxialCoreY
source: Leg position (meters)
hu_hu: Lábak pozíciója (méterben)

# SettingTurntableAxialView
source: View
hu_hu: Nézet

# SettingTurntableHasMirror
source: Uses mirror
hu_hu: Tükör használata

# SettingTurntableMode
source: Mode
hu_hu: Modellalkotási mód

# SettingTurntableSaveModelResolution
source: Model resolution (vertices/leg)
hu_hu: Modell felbontása (vertexek/láb)

# SettingTurntableSaveTextureResolution
source: Texture resolution (pixels/leg)
hu_hu: Textúra felbontása (pixelek/láb)

# SettingTurntableTransform
source: Turntable matrix
hu_hu: Forgópad mátrix

# SettingTurntableVolumetricCubeResolution
source: Cube resolution (voxels)
hu_hu: Kocka felbontása (voxelben)

# SettingTurntableVolumetricCubeSize
source: Cube size (centimeters)
hu_hu: Kocka mérete (centiméterben)

# SettingTurntableVolumetricGradientLimit
source: Gradient limit (units)
hu_hu: Gradiens küszöb (egységben)

# SettingTurntableVolumetricSlice
source: Current depth (units)
hu_hu: Jelenlegi mélység (egységben)

# SettingTurntableVolumetricThreshold
source: Threshold (units)
hu_hu: Küszöb (egységben)

# SettingTurntableVolumetricView
source: View
hu_hu: Nézet

# SettingUseModuleShading
source: Use module shading (if available)
hu_hu: Használjon modul árnyalást (ha elérhető)

# SettingWireframeShading
source: Wireframe shading
hu_hu: Dróthálós árnyalás

# StatusCannotConnectToKinect
source: Cannot connect to Kinect!
hu_hu: Nem sikerült kapcsolódni a Kinecthez!

# StatusDeviceCannotBeOpened
source: The device can not be opened. May be on low power, brandwith or may be already in use.
hu_hu: Az eszközt nem sikerült megnyitni. Ellenőrizze, hogy be van-e dugva a tápegysége, elégséges a sávszélesség és jelenleg nincs-e használatban.

# StatusDevicesConnected
source: {0} device(s) connected.
hu_hu: {0} eszköz csatlakoztatva.

# StatusFileLoadedSuccesfully
source: File loaded successfully.
hu_hu: Fájl sikeresen betöltve.

# StatusLoading
source: Loading...
hu_hu: Betöltés...

# StatusPreparingKinect
source: Preparing Kinect...
hu_hu: Kinect előkészítése...

# StatusReady
source: Ready.
hu_hu: Kész.

# StatusSaveComplete
source: Save complete.
hu_hu: Mentés kész.

# StatusSaveInProgress
source: Save in progress...
hu_hu: Mentés folyamatban...

# StatusStarting
source: Starting...
hu_hu: Kezdés...

# StatusStopping
source: Stopping...
hu_hu: Leállás...

# TitleError
source: Error
hu_hu: Hiba

# TurntableCalibrationStep1
source: Remove any objects from the turntable, then click next.
hu_hu: Távolítson el mindent a forgópadról, majd kattintson a következő gombra!

# TurntableCalibrationStep2
source: Select the turntable on the image with the mouse: move the cursor to the upper-left corner of the imaginary boundary rectangle of the turntable, then hold down the left button, and move the mouse to the bottom-right corner and release the button. You may repeat this procedure to select the turntable correctly. Click next to continue.
hu_hu: Jelölje ki a forgópadot a képen az egérrel! Az egér bal gombját nyomja le a forgópad képzeletbeli burkoló téglalapjának bal-felső sarkában, majd a gombot lenyomva tartva mozgassa az egeret a jobb-alsó sarokba és engedje fel! Ügyeljen arra, hogy csak a forgópad kerüljön kijelölésre! Ez a művelet akárhányszor megismételhető. Kattintson a következőre a folytatáshoz!

# TurntableCalibrationStep3
source: Place the calibration standard to the turntable: the standard should face toward the scanner's mirror and it should snap in the holes on the turntable. Click next to continue.
hu_hu: Helyezze a kalibráló etalont a forgópadra, úgy hogy az szembe nézzen a tükörrel, és a lapok kb. 90-120 fokos szöget zárjanak be egymással! Kattintson a következőre a folytatáshoz!

# TurntableCalibrationStep4
source: Select the standard's left side on the image with the mouse (like in step 2). Click next to select the right side.
hu_hu: Jelölje ki az etalont, ügyelve arra, hogy semmi mást nem jelöl ki a képen. Ügyeljen arra is, hogy a kijelölés szimmetrikus legyen az etalon hajtási tengelyére! Kattintson a következőre, hogy megtekinthesse a kalibráció eredményeit!

# TurntableCalibrationStep5
source: Select the standard's right side on the image. Click next to preview the calibration results.
hu_hu: Ellenőrizze, hogy a forgópad és az etalon lapjainak helymeghatározása jól sikerült-e! Kattintson a befejezésre az eredmények elfogadásához.

# TurntableCalibrationTitle
source: Turntable Calibration
hu_hu: A forgópad kalibrációja

# TurntableStepCounterCloseTitle
source: End of measurement
hu_hu: Mérés befejezése

# TurntableStepCounterInformation
source: With this tool, you can count the steps corresponding to one full rotation of the turntable. Press Start to begin!
hu_hu: Ezzel az eszközzel megmérheti, hogy hány lépés szükséges a fogópad egy teljes körbeforgatásához.

# TurntableStepCounterPasses
source: pass(es).
hu_hu: menet(ek).

# TurntableStepCounterSaveResults
source: Would you like to save the results as settings?
hu_hu: El kívánja menteni az ereményeket a beállításokba?

# TurntableStepCounterStatusMovingToOrigin
source: Moving to origin....
hu_hu: Alaphelyzet megkeresése....

# TurntableStepCounterStatusPremovement
source: Premovement...
hu_hu: Előmozgás...

# TurntableStepCounterStatusReady
source: Ready.
hu_hu: Készenlét

# TurntableStepCounterStatusWaitingForSwitch
source: Waiting for magnetic switch...
hu_hu: Várakozás a mágneskapcsolóra...

# TurntableStepCounterSteps
source: steps.
hu_hu: lépés.

# TurntableStepCounterStepsPerRotation
source: steps per rotation.
hu_hu: lépészsám fordulatonként.

# TurntableStepCounterTitle
source: Turntable step counter
hu_hu: Forgópad lépésszámláló
